{
  "latest_app_version": 36,
  "changelog": [
    {
      "ver": "1.2.10.1",
      "description": "-Fix visualizzazione di alcune misure."
    },
    {
      "ver": "1.2.10",
      "description": "-Per alleggerire il carico vengono adesso scaricati di default solo i dati degli ultimi 365 giorni. Per ottenere i dati da inizio pandemia utilizzare il menù."
    },
    {
      "ver": "1.2.9",
      "description": "-Rimosse misure non più calcolate\n-Aggiunto retry in caso di fallimento nel recupero dai dati.\n-Gestione traduzione misure mancanti"
    },
    {
      "ver": "1.2.8",
      "description": "-Zoom asse X e Y resa indipendente"
    },
    {
      "ver": "1.2.7",
      "description": "-Minor fix"
    },
    {
      "ver": "1.2.6.2",
      "description": "-Minor fix"
    },
    {
      "ver": "1.2.6.1",
      "description": "-Dal 24/01/2021 è stato aggiunto il supporto alle misure \'Totale Positivi Test Antigenico Repido\', \'Tamponi Test Molecolare\', \'Totale Positivi Test Molecolare\' e \'Tamponi Test Antigenico Rapido\'"
    },
    {
      "ver": "1.2.6",
      "description": "-Dal 03/12/2020 le misure \'Casi da sospetto diagnostico\' e \'Casi da screening\' non vengono più fornite dalla Protezione Civile.\n-Dal 03/12/2020 è disponibile la nuova misura \'Ingressi Terapia Intensiva\'"
    },
    {
      "ver": "1.2.5",
      "description": "-È stata aggiunta la cache per velocizzare l'apertura dell'applicazione. È adesso possibile consultare l'ultima versione dei dati precedentemente scaricati senza la necessità di avere una connessione internet."
    },
    {
      "ver": "1.2.4.1",
      "description": "-Aggiunta misura rapporto tra nuovi positivi e nuovi tamponi giornaliri\n-Minor fix"
    },
    {
      "ver": "1.2.4",
      "description": "ATTENZIONE: Per l\'installazione della versione 1.2.4 è necessario disinstallare le precedenti (Ho perso la chiave di build...).\n\nNovità:\n-Aggiunta misura Nuovi Tamponi Effettuati (corrisponde alla variazione della misura Tot. Tamponi Effettuati)\n-Rimosso pulsate visualizzazione numerica nel grafico temporale (Non era più utilizzabile da tempo)"
    },
    {
      "ver": "1.2.3.2",
      "description": "-Sistemato calcolo per dati provinciali In fase di definizione o Fuori Regione/P.A"
    },
    {
      "ver": "1.2.3.1",
      "description": "-Hotfix: Adattamento alla nuova struttura dati rilasciata dalla Protezione Civile in data 29/06/2020. Sono state aggiunte due nuove misure: Casi da Sospetto Diagnostico e Casi da Screening. \n\nNote: \n1) Le due nuove misure sono valorizzate dal 25/06/2020 in poi. \n2)Al momento gli avvisi sui dati sono stati disattivati per assenza degli stessi."
    },
    {
      "ver": "1.2.3",
      "description": "-Fix crash nei dati provinciali e regionali. Problema dovuto alla modifica dei dati forniti dalla Protezione Civile."
    },
    {
      "ver": "1.2.2",
      "description": "-Aggiunta nuova misura (Casi Testati) fornita dalla Protezione Civile. Tale misura rappresenta gli individui distinti che sono stati sottoposti almeno una volta al tampone.\n\nNota: I primi dati di questa misura risalgono al 19/04/2020"
    },
    {
      "ver": "1.2.1.1",
      "description": "-Minor Fix"
    },
    {
      "ver": "1.2.1",
      "description": "-Aggiunta Dark Mode."
    },
    {
      "ver": "1.2.0",
      "description": "-Aggiunta visualizzazione temporale per i dati delle Province.\n-Aggiunta Icona per le province.\n-Fix visualizzazione avvisi multipli.\n-Aggiunto DatePicker per scegliere direttamente il giorno da visualizzare.\n-Possibilità di contattare lo sviluppatore dal Menu principale."
    },
    {
      "ver": "1.1.8.1",
      "description": "-Adesso è possibile premere le barre dell'istogramma Provinciale per visualizzare ulteriori dettagli.\n-Piccole migliorie grafiche."
    },
    {
      "ver": "1.1.8",
      "description": "-Aggiunta possibilità di confrontare la variazione percentuale delle misure nell'istogramma regionale. Adesso è anche possibile premere le barre dell'istogramma per visualizzare ulteriori dettagli.\n-Cambiate alcune icone\n\nNota: Questa funzionalità è stata aggiunta sono nell'istogramma relativo alle regioni in quanto le misure disponibili per le province sono poche e spesso poco affidabili."
    },
    {
      "ver": "1.1.7",
      "description": "-Aggiunta possbilità di cambiare il contesto dati direttamente dal grafico temporale."
    },
    {
      "ver": "1.1.6.2",
      "description": "-Fix dovuto al cambiamento del formato dati fornito dalla Protezione Civile."
    },
    {
      "ver": "1.1.6.1",
      "description": "-Fix crash nella selezione delle province."
    },
    {
      "ver": "1.1.6",
      "description": "-Migliorata visualizzazione presenza avvisi sui dati."
    },
    {
      "ver": "1.1.5",
      "description": "-Aggiunti avvisi relativi ai dati.\n\nNota: Se sono presenti avvisi sui dati visualizzati, vengono aggiunte delle icone vicino la data. È possibile premerle per visualizzare l'avviso."
    },
    {
      "ver": "1.1.4.1",
      "description": "-Minor Fix."
    },
    {
      "ver": "1.1.4",
      "description": "-Aggiunte statistiche.\n-Aggiunta possibilità di visualizzare o nascondere le informazioni extra (statistiche e dati provinciali).\n-Cambiate alcune icone"
    },
    {
      "ver": "1.1.3",
      "description": "-Gli Istogrammi possono essere ordinati per valori crescenti."
    },
    {
      "ver": "1.1.2",
      "description": "-Sbloccato orientamento grafici.\n-Migliorie minori."
    },
    {
      "ver": "1.1.1",
      "description": "-Aggiunta visualizzazione dei Nuovi Casi per Provincia (Dato calcolato a partire dai casi totali).\n-Minor refactor grafico.\n\nNota: I Nuovi Casi per Provincia possono risultare negativi in quanto a volte il Totale Casi di un giorno è inferiore al Totale Casi del giorno precedente a causa di una ridistribuzione dei dati."
    },
    {
      "ver": "1.1.0",
      "description": "-Aggiunta visualizzazione dei Totali Casi per Provincia (Unico dato fornito dalla Protezione Civile).\n-Aggiunto Istogramma per il confronto tra Province.\n-Minor refactor Grafico."
    },
    {
      "ver": "1.0.3",
      "description": "-È stata aggiunta la descrizione delle misure che viene visualizzata al click nell'elenco.\n-Aggiunto Changelog."
    }
  ]
}